#include <stdio.h>
/*
 * 校验奇偶
 * */

int even_parity(int value)
{
    return (value<<31>>31) & 1;
    /*
     左移31位然后右移31位之后，整个比特序列要么全0要么全1，再拿其与1进行 '&' 操作
     11111111 11111111 11111111 11111111
     00000000 00000000 00000000 00000001
     此时为奇数
     或者
     00000000 00000000 00000000 00000000
     00000000 00000000 00000000 00000001
     此时为负数
     */
}

int main(){
    int ret = even_parity(-11);
    printf("ret = %d\n",ret);
    for (int i = -10000; i < 10000; ++i) {
        printf("%d:%d\n",i,even_parity(i));
    }
    return 0;
}